_org/books/Writing GNU Emacs Extensions.org
#+BEGIN_HTML
--- layout: notes ---
#+END_HTML
#+TOC: headlines 4


/Writing GNU Emacs Extensions: Editor Customizations and Creations with Lisp
(Nutshell Handbooks)/ – Bob Glickstein

Lisp is more concise: (+ a b c d e)

The single keystroke META-x can always be replaced with the two-key sequence ESC
x.

C-z has a default binding of iconify-or-deiconify-frame when running under X,
and suspend-emacs when running in a character terminal. In both cases, the
function is also bound to C-x C-z, so there’s no need to rebind them.

You can use the *scratch* buffer. This buffer is automatically created when
Emacs starts. The buffer is in Lisp Interaction mode. In this mode, pressing C-j
invokes eval-print-last-sexp, which is like eval-last-sexp except that the
result of the evaluation is inserted into the buffer at the location of the
cursor.

apropos is invoked with a prefix argument, it not only reports Emacs functions
and variables that match the search pattern, it also reports any existing
keybindings for each command in the list.

* Nil

 The symbol nil is special in Lisp for three reasons: a value of nil means
 “false” and any other value means “true.”

 Inside the Lisp interpreter, the symbol nil and the empty list () are the same
 object.

 It is its own value. When you evaluate the symbol nil, the result is nil. For
 this reason, unlike other symbols, nil doesn’t need to be quoted when you want
 its name instead of its value, because its name is the same as its value.

 So you can write (setq x nil)      ;assign nil to variable x instead of writing
 (setq x 'nil)

  “truth” in Lisp can be represented by any expression except nil,

  The empty list () is synonymous with the symbol nil. This does not mean that
  () is the same as (nil).

* Interactive

  The code letter p used in this example means, “if there is a prefix argument,
  interpret it as a number, and if there is no prefix argument, interpret that
  as the number 1.”

  It’s important to understand the difference between the two expressions (- n)
  and -1. The first is a function call. There must be a space between the
  function name and the argument. The second expression is an integer constant.
  There may not be a space between the minus sign and the 1. It is certainly
  possible to write (- 1) (though there’s no reason to incur the cost of a
  function call when you can alternatively write -1). It is not possible to
  write -n, because n is not a constant.

  The capital P means “when called interactively, leave the prefix argument in
  raw form and assign it to n.” The raw form of a prefix argument is a data
  structure used internally by Emacs to record the prefix information the user
  gave before invoking a command.

  The asterisk, when it is the first character in an interactive argument, means
  “abort this function if the current buffer is read-only.”

  The @ in the interactive declaration means, “Before doing anything else, find
  the mouse click (if any)

  The code letter e tells interactive to bundle up the mouse event that invoked
  this command as a list and assign it to event.

* Parameters

  The keyword &optional appearing in a parameter list means that all subsequent
  parameters are optional.

* Tricks

  In general, (if test     (a  b)   (a  c)) can be shortened to (a (if test b
  c)).


  An old Lisp programmers’ trick can now be used to make this expression even
  more concise: (if n n 1) ≡ (or n 1)


  Lisp’s or has an extra bit of usefulness: it evaluates each of its arguments
  in order until it finds one that’s non-nil, then it returns that value. If it
  doesn’t find one, it returns nil.


  generally speaking,


  (if a  a  b) can be replaced by (or a  b)


  (if a  a                 ;if a is true, return a   (if b  b              
  ;else if b is true, return b     ...       (if y  y  z)))     ;else if y is
  true, return y, else z (which might look artificial here but is actually a
  pretty common pattern in actual programs) can be changed to the following
  form. (or a  b ... y  z) subject to the warning about evaluating expressions
  multiple times. Similarly, (if a   (if b     ...       (if y  z))) (note that
  none of the ifs in this example has an “else” clause) can also be written as
  (and a  b ... y  z) because and works by evaluating each of its arguments in
  order until it finds one that’s nil. If it finds one, it returns nil, and if
  it doesn’t find one, it returns the value of the last argument.

* defalias

  We can use defalias to refer to any Lisp function by a different name.
  (defalias 'scroll-ahead 'scroll-up) (defalias 'scroll-behind 'scroll-down)

* functions

  “Point” refers to the position of the cursor.

  The function file-symlink-p tests whether its argument, which is a string
  naming a file, refers to a symbolic link. It’s a Boolean predicate, meaning it
  returns true or false. In Lisp, predicates traditionally have names ending in
  p or -p.

  A progn expression evaluates each of its subexpressions in order and returns
  the value of the last one.

  It’s possible to define a function without giving it a name. Such functions
  are appropriately known as anonymous functions. They’re created with the Lisp
  keyword lambda

  An anonymous function definition can be used wherever you might use the name
  of a function:

  There’s one reason not to use anonymous functions in hooks. If you ever wish
  to remove a function from a hook, you need to refer to it by name in a call to
  remove-hook, like so: (remove-hook 'find-file-hooks 'read-only-if-symlink)

  The insert function takes any number of arguments (which must all be strings
  or characters) and inserts them one after another in the current buffer at the
  present location of point, moving point forward.

  The keyword &rest, followed by a parameter name, must appear last in a
  function’s parameter list. It means “collect up any remaining arguments into a
  list and assign it to the last parameter”

  The function crossword--set has a double hyphen in its name. This is the
  conventional way to denote a "private” function that isn’t part of a package’s
  advertised programming interface.

