books/Writing GNU Emacs Extensions.html
--- layout: notes ---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Nil</a></li>
<li><a href="#sec-2">2. Interactive</a></li>
<li><a href="#sec-3">3. Parameters</a></li>
<li><a href="#sec-4">4. Tricks</a></li>
<li><a href="#sec-5">5. defalias</a></li>
<li><a href="#sec-6">6. functions</a></li>
<li><a href="#sec-7">7. Hooks</a></li>
<li><a href="#sec-8">8. Temp variables</a></li>
<li><a href="#sec-9">9. advice</a></li>
<li><a href="#sec-10">10. defvar, setq, global variable</a></li>
<li><a href="#sec-11">11. Window</a></li>
<li><a href="#sec-12">12. Command</a></li>
<li><a href="#sec-13">13. Properties</a></li>
<li><a href="#sec-14">14. Markers</a></li>
<li><a href="#sec-15">15. Time</a></li>
<li><a href="#sec-16">16. Save-excursion / data / restriction</a></li>
<li><a href="#sec-17">17. Regexp</a></li>
<li><a href="#sec-18">18. After change</a></li>
<li><a href="#sec-19">19. Require and Provide</a></li>
<li><a href="#sec-20">20. User options</a></li>
<li><a href="#sec-21">21. Autoloading</a></li>
<li><a href="#sec-22">22. byte-compile</a></li>
<li><a href="#sec-23">23. File variable</a></li>
<li><a href="#sec-24">24. List</a></li>
<li><a href="#sec-25">25. Syntax table</a></li>
<li><a href="#sec-26">26. Macro function</a></li>
<li><a href="#sec-27">27. Backquote</a></li>
<li><a href="#sec-28">28. Remove outer parentheses</a></li>
<li><a href="#sec-29">29. Let</a></li>
<li><a href="#sec-30">30. Fail gracefully</a></li>
<li><a href="#sec-31">31. defalias</a></li>
<li><a href="#sec-32">32. Keymap</a></li>
<li><a href="#sec-33">33. derive-mode</a></li>
<li><a href="#sec-34">34. Vectors</a></li>
<li><a href="#sec-35">35. Inline functions</a></li>
<li><a href="#sec-36">36. Equivalence pairs</a></li>
<li><a href="#sec-37">37. Mouse</a></li>
<li><a href="#sec-38">38. Asynchronous</a></li>
<li><a href="#sec-39">39. Process</a>
<ul>
<li><a href="#sec-39-1">39.1. Sentinel</a></li>
</ul>
</li>
<li><a href="#sec-40">40. Filter</a></li>
<li><a href="#sec-41">41. Eval lisp</a></li>
<li><a href="#sec-42">42. debugger</a></li>
<li><a href="#sec-43">43. Profiling</a></li>
</ul>
</div>
</nav>


<p>
<i>Writing GNU Emacs Extensions: Editor Customizations and Creations with Lisp
(Nutshell Handbooks)</i> – Bob Glickstein
</p>

<p>
Lisp is more concise: (+ a b c d e)
</p>

<p>
The single keystroke META-x can always be replaced with the two-key sequence ESC
x.
</p>

<p>
C-z has a default binding of iconify-or-deiconify-frame when running under X,
and suspend-emacs when running in a character terminal. In both cases, the
function is also bound to C-x C-z, so there’s no need to rebind them.
</p>

<p>
You can use the <b>scratch</b> buffer. This buffer is automatically created when
Emacs starts. The buffer is in Lisp Interaction mode. In this mode, pressing C-j
invokes eval-print-last-sexp, which is like eval-last-sexp except that the
result of the evaluation is inserted into the buffer at the location of the
cursor.
</p>

<p>
apropos is invoked with a prefix argument, it not only reports Emacs functions
and variables that match the search pattern, it also reports any existing
keybindings for each command in the list.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Nil</h2>
<div class="outline-text-2" id="text-1">
<p>
The symbol nil is special in Lisp for three reasons: a value of nil means
“false” and any other value means “true.”
</p>

<p>
Inside the Lisp interpreter, the symbol nil and the empty list () are the same
object.
</p>

<p>
It is its own value. When you evaluate the symbol nil, the result is nil. For
this reason, unlike other symbols, nil doesn’t need to be quoted when you want
its name instead of its value, because its name is the same as its value.
</p>

<p>
So you can write (setq x nil)      ;assign nil to variable x instead of writing
(setq x 'nil)
</p>

<p>
“truth” in Lisp can be represented by any expression except nil,
</p>

<p>
The empty list () is synonymous with the symbol nil. This does not mean that
() is the same as (nil).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Interactive</h2>
<div class="outline-text-2" id="text-2">
<p>
The code letter p used in this example means, “if there is a prefix argument,
interpret it as a number, and if there is no prefix argument, interpret that
as the number 1.”
</p>

<p>
It’s important to understand the difference between the two expressions (- n)
and -1. The first is a function call. There must be a space between the
function name and the argument. The second expression is an integer constant.
There may not be a space between the minus sign and the 1. It is certainly
possible to write (- 1) (though there’s no reason to incur the cost of a
function call when you can alternatively write -1). It is not possible to
write -n, because n is not a constant.
</p>

<p>
The capital P means “when called interactively, leave the prefix argument in
raw form and assign it to n.” The raw form of a prefix argument is a data
structure used internally by Emacs to record the prefix information the user
gave before invoking a command.
</p>

<p>
The asterisk, when it is the first character in an interactive argument, means
“abort this function if the current buffer is read-only.”
</p>

<p>
The @ in the interactive declaration means, “Before doing anything else, find
the mouse click (if any)
</p>

<p>
The code letter e tells interactive to bundle up the mouse event that invoked
this command as a list and assign it to event.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Parameters</h2>
<div class="outline-text-2" id="text-3">
<p>
The keyword &amp;optional appearing in a parameter list means that all subsequent
parameters are optional.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Tricks</h2>
<div class="outline-text-2" id="text-4">
<p>
In general, (if test     (a  b)   (a  c)) can be shortened to (a (if test b
c)).
</p>


<p>
An old Lisp programmers’ trick can now be used to make this expression even
more concise: (if n n 1) ≡ (or n 1)
</p>


<p>
Lisp’s or has an extra bit of usefulness: it evaluates each of its arguments
in order until it finds one that’s non-nil, then it returns that value. If it
doesn’t find one, it returns nil.
</p>


<p>
generally speaking,
</p>


<p>
(if a  a  b) can be replaced by (or a  b)
</p>


<p>
(if a  a                 ;if a is true, return a   (if b  b              
;else if b is true, return b     &#x2026;       (if y  y  z)))     ;else if y is
true, return y, else z (which might look artificial here but is actually a
pretty common pattern in actual programs) can be changed to the following
form. (or a  b &#x2026; y  z) subject to the warning about evaluating expressions
multiple times. Similarly, (if a   (if b     &#x2026;       (if y  z))) (note that
none of the ifs in this example has an “else” clause) can also be written as
(and a  b &#x2026; y  z) because and works by evaluating each of its arguments in
order until it finds one that’s nil. If it finds one, it returns nil, and if
it doesn’t find one, it returns the value of the last argument.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> defalias</h2>
<div class="outline-text-2" id="text-5">
<p>
We can use defalias to refer to any Lisp function by a different name.
(defalias 'scroll-ahead 'scroll-up) (defalias 'scroll-behind 'scroll-down)
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> functions</h2>
<div class="outline-text-2" id="text-6">
<p>
“Point” refers to the position of the cursor.
</p>

<p>
The function file-symlink-p tests whether its argument, which is a string
naming a file, refers to a symbolic link. It’s a Boolean predicate, meaning it
returns true or false. In Lisp, predicates traditionally have names ending in
p or -p.
</p>

<p>
A progn expression evaluates each of its subexpressions in order and returns
the value of the last one.
</p>

<p>
It’s possible to define a function without giving it a name. Such functions
are appropriately known as anonymous functions. They’re created with the Lisp
keyword lambda
</p>

<p>
An anonymous function definition can be used wherever you might use the name
of a function:
</p>

<p>
There’s one reason not to use anonymous functions in hooks. If you ever wish
to remove a function from a hook, you need to refer to it by name in a call to
remove-hook, like so: (remove-hook 'find-file-hooks 'read-only-if-symlink)
</p>

<p>
The insert function takes any number of arguments (which must all be strings
or characters) and inserts them one after another in the current buffer at the
present location of point, moving point forward.
</p>

<p>
The keyword &amp;rest, followed by a parameter name, must appear last in a
function’s parameter list. It means “collect up any remaining arguments into a
list and assign it to the last parameter”
</p>

<p>
The function crossword&#x2013;set has a double hyphen in its name. This is the
conventional way to denote a "private” function that isn’t part of a package’s
advertised programming interface.
</p>
</div>
</div>
