_org/books/Writing GNU Emacs Extensions.org
* Hooks

  post-command-hook is a list of functions to run after every interactive
  command.

  Using M-x apropos RET hook RET,

  A buffer-local version of write-file-hooks. Recall from the Hooks section of
  Chapter 2 that a buffer-local variable is one that can have different values
  in different buffers.

  Thus, if you want to run one function while saving a Lisp file and another one
  when saving a text file, local-write-file-hooks is the one to use.

  functions in local-write-file-hooks (also in write-file-hooks and
  write-contents-hooks), a non-nil return value means, “This hook function has
  taken over the job of writing the buffer to a file.”

  Although ordinary variables are made buffer-local with either
  make-local-variable or make-variable-buffer-local (see below), hook variables
  must be made buffer-local with make-local-hook.

* Temp variables


  In Lisp, temporary variables are created with let, whose syntax is (let
  ((var1 value1)       (var2 value2)       ...       (varn valuen))
    body1 body2 ... bodyn)

* advice

  A piece of advice attached to a Lisp function is code that gets executed
  before or after the function each time the function is invoked. Before advice
  can affect the arguments before they’re passed to the advised function. After
  advice can affect the return value that comes out of the advised function.
  Advice is a little bit like hook variables, but whereas Emacs defines only a
  few dozen hook variables for very particular circumstances, you get to choose
  which functions get “advised.”

* defvar, setq, global variable

  We’ll use defvar to declare the variable.

  Setting a variable’s default value with defvar is different from setting a
  variable’s value with setq. Instead of unconditionally assigning the value to
  the variable like setq does, defvar assigns the value only if the variable
  does not yet have any value.

  (*). A leading asterisk has special meaning in defvar docstrings. It means
  that the variable in question is a user option.

* Window
  Emacs provides several functions describing what’s visible in a window, such
  as window-edges, window-height, and current-window-configuration.

* Command

  ~last-command~

  this-command the variable that contains the name of the current command
  invoked by the user.

* Properties

  In addition to having a variable value and/or a function definition, every
  Emacs Lisp symbol may also have associated with it a property list.

  Properties are stored with the put function and retrieved with the get
  function.

* Markers

  markers. A marker is a special object that specifies a buffer position just
  like an integer does. But if the buffer position moves because of insertions
  or deletions, the marker “moves” too so that it keeps pointing to the same
  spot in the text.

* Time

  Emacs includes a few other time-related functions, notably current-time, which
  yields the current time in a raw form, and format-time-string, which can take
  such a time and format it in a wide variety of ways (in the style of C’s
  strftime).

* Save-excursion / data / restriction

  What save-excursion does is memorize the position of the cursor, execute the
  subexpressions it’s given as arguments, then restore the cursor to its
  original position.

  save-restriction. This is like save-excursion in that it memorizes some
  information, then executes its arguments, then restores the information. The
  information in this case is the buffer’s restriction, which is the result of
  narrowing.

  save-match-data that, like save-excursion and save-restriction, memorizes some
  information, executes its arguments, then restores the information. This time
  the information in question is the result of the latest search.

* Regexp

  Emacs provides a function for this purpose called regexp-quote, which
  understands regexp syntax and can turn a possibly-magic string into the
  corresponding non-magic one.

* After change

  after-change-functions contains functions to call after each buffer change.

  This use of let creates a temporary variable, after-change-functions, that
  supersedes the global after-change-functions during the call to
  update-modifystamps in the body of the let. After the let exits, the temporary
  after-change-functions disappears and the global one is again in effect.

* Require and Provide


  require and provide, give a way to make sure it only gets loaded once instead
  of n times.

  (provide 'timestamp) (require 'timestamp "timestamp")

  The string equivalent of the feature symbol timestamp is "timestamp", so we
  can write (require 'timestamp) instead of (require 'timestamp "timestamp").
  (The function symbol-name called on a symbol yields its string equivalent.)

* User options

  Hooking user options into the “customize” system requires using special
  functions called defgroup and defcustom.

* Autoloading

  You ask Emacs to find a Lisp file in the load path and you omit the suffix of
  the file for which you’re looking — e.g., you specify foo instead of foo.el —
  Emacs first looks for foo.elc, the byte-compiled form of foo.el. If that’s not
  found in the load path, then foo.el is tried, followed by plain foo. It’s
  usually best to omit the suffix when specifying a file to load. Not only does
  it get you that useful search behavior, but it helps eval-after-load to work
  properly

  With autoloading, you can arrange to defer loading a file until it’s needed —
  that is, until you call one of its functions. Setting up autoloads is very
  inexpensive, and therefore is usually done in the .emacs file.

  The function autoload connects a function name with the file that defines it.

  The autoload function has several optional parameters. The first one is a
  docstring for the not-yet-defined function.

  The next optional parameter describes whether the function, once loaded, will
  be an interactive command or a mere function.

  The last optional parameter is one we won’t cover for now. It specifies the
  type of the autoloadable object, if not a function. As it turns out, keymaps
  and macros (which we’ll cover in coming chapters) may also be autoloaded.

  If you’d like to defer the execution of some code until a particular file has
  been loaded, eval-after-load is the way to do it.

  The load or autoload or require that causes dired to be loaded must refer to
  it by exactly the same name used in eval-after-load.

  Another use for eval-after-load is when you need to refer to a variable,
  function, or keymap in a package that’s not loaded yet, and you don’t want to
  force the package to be loaded:

