books/Writing GNU Emacs Extensions.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Hooks</h2>
<div class="outline-text-2" id="text-7">
<p>
post-command-hook is a list of functions to run after every interactive
command.
</p>

<p>
Using M-x apropos RET hook RET,
</p>

<p>
A buffer-local version of write-file-hooks. Recall from the Hooks section of
Chapter 2 that a buffer-local variable is one that can have different values
in different buffers.
</p>

<p>
Thus, if you want to run one function while saving a Lisp file and another one
when saving a text file, local-write-file-hooks is the one to use.
</p>

<p>
functions in local-write-file-hooks (also in write-file-hooks and
write-contents-hooks), a non-nil return value means, “This hook function has
taken over the job of writing the buffer to a file.”
</p>

<p>
Although ordinary variables are made buffer-local with either
make-local-variable or make-variable-buffer-local (see below), hook variables
must be made buffer-local with make-local-hook.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Temp variables</h2>
<div class="outline-text-2" id="text-8">
<p>
In Lisp, temporary variables are created with let, whose syntax is (let
((var1 value1)       (var2 value2)       &#x2026;       (varn valuen))
  body1 body2 &#x2026; bodyn)
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> advice</h2>
<div class="outline-text-2" id="text-9">
<p>
A piece of advice attached to a Lisp function is code that gets executed
before or after the function each time the function is invoked. Before advice
can affect the arguments before they’re passed to the advised function. After
advice can affect the return value that comes out of the advised function.
Advice is a little bit like hook variables, but whereas Emacs defines only a
few dozen hook variables for very particular circumstances, you get to choose
which functions get “advised.”
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> defvar, setq, global variable</h2>
<div class="outline-text-2" id="text-10">
<p>
We’ll use defvar to declare the variable.
</p>

<p>
Setting a variable’s default value with defvar is different from setting a
variable’s value with setq. Instead of unconditionally assigning the value to
the variable like setq does, defvar assigns the value only if the variable
does not yet have any value.
</p>

<p>
(*). A leading asterisk has special meaning in defvar docstrings. It means
that the variable in question is a user option.
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Window</h2>
<div class="outline-text-2" id="text-11">
<p>
Emacs provides several functions describing what’s visible in a window, such
as window-edges, window-height, and current-window-configuration.
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Command</h2>
<div class="outline-text-2" id="text-12">
<p>
<code>last-command</code>
</p>

<p>
this-command the variable that contains the name of the current command
invoked by the user.
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Properties</h2>
<div class="outline-text-2" id="text-13">
<p>
In addition to having a variable value and/or a function definition, every
Emacs Lisp symbol may also have associated with it a property list.
</p>

<p>
Properties are stored with the put function and retrieved with the get
function.
</p>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Markers</h2>
<div class="outline-text-2" id="text-14">
<p>
markers. A marker is a special object that specifies a buffer position just
like an integer does. But if the buffer position moves because of insertions
or deletions, the marker “moves” too so that it keeps pointing to the same
spot in the text.
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Time</h2>
<div class="outline-text-2" id="text-15">
<p>
Emacs includes a few other time-related functions, notably current-time, which
yields the current time in a raw form, and format-time-string, which can take
such a time and format it in a wide variety of ways (in the style of C’s
strftime).
</p>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Save-excursion / data / restriction</h2>
<div class="outline-text-2" id="text-16">
<p>
What save-excursion does is memorize the position of the cursor, execute the
subexpressions it’s given as arguments, then restore the cursor to its
original position.
</p>

<p>
save-restriction. This is like save-excursion in that it memorizes some
information, then executes its arguments, then restores the information. The
information in this case is the buffer’s restriction, which is the result of
narrowing.
</p>

<p>
save-match-data that, like save-excursion and save-restriction, memorizes some
information, executes its arguments, then restores the information. This time
the information in question is the result of the latest search.
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Regexp</h2>
<div class="outline-text-2" id="text-17">
<p>
Emacs provides a function for this purpose called regexp-quote, which
understands regexp syntax and can turn a possibly-magic string into the
corresponding non-magic one.
</p>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> After change</h2>
<div class="outline-text-2" id="text-18">
<p>
after-change-functions contains functions to call after each buffer change.
</p>

<p>
This use of let creates a temporary variable, after-change-functions, that
supersedes the global after-change-functions during the call to
update-modifystamps in the body of the let. After the let exits, the temporary
after-change-functions disappears and the global one is again in effect.
</p>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Require and Provide</h2>
<div class="outline-text-2" id="text-19">
<p>
require and provide, give a way to make sure it only gets loaded once instead
of n times.
</p>

<p>
(provide 'timestamp) (require 'timestamp "timestamp")
</p>

<p>
The string equivalent of the feature symbol timestamp is "timestamp", so we
can write (require 'timestamp) instead of (require 'timestamp "timestamp").
(The function symbol-name called on a symbol yields its string equivalent.)
</p>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> User options</h2>
<div class="outline-text-2" id="text-20">
<p>
Hooking user options into the “customize” system requires using special
functions called defgroup and defcustom.
</p>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Autoloading</h2>
<div class="outline-text-2" id="text-21">
<p>
You ask Emacs to find a Lisp file in the load path and you omit the suffix of
the file for which you’re looking — e.g., you specify foo instead of foo.el —
Emacs first looks for foo.elc, the byte-compiled form of foo.el. If that’s not
found in the load path, then foo.el is tried, followed by plain foo. It’s
usually best to omit the suffix when specifying a file to load. Not only does
it get you that useful search behavior, but it helps eval-after-load to work
properly
</p>

<p>
With autoloading, you can arrange to defer loading a file until it’s needed —
that is, until you call one of its functions. Setting up autoloads is very
inexpensive, and therefore is usually done in the .emacs file.
</p>

<p>
The function autoload connects a function name with the file that defines it.
</p>

<p>
The autoload function has several optional parameters. The first one is a
docstring for the not-yet-defined function.
</p>

<p>
The next optional parameter describes whether the function, once loaded, will
be an interactive command or a mere function.
</p>

<p>
The last optional parameter is one we won’t cover for now. It specifies the
type of the autoloadable object, if not a function. As it turns out, keymaps
and macros (which we’ll cover in coming chapters) may also be autoloaded.
</p>

<p>
If you’d like to defer the execution of some code until a particular file has
been loaded, eval-after-load is the way to do it.
</p>

<p>
The load or autoload or require that causes dired to be loaded must refer to
it by exactly the same name used in eval-after-load.
</p>

<p>
Another use for eval-after-load is when you need to refer to a variable,
function, or keymap in a package that’s not loaded yet, and you don’t want to
force the package to be loaded:
</p>
</div>
</div>
