_org/books/Writing GNU Emacs Extensions.org
* byte-compile

  There are several ways to byte-compile files. The most straightforward ways
  are From within Emacs: Execute M-x byte-compile-file RET file.el RET. From the
  UNIX shell: Run emacs -batch -f batch-byte-compile file.el.


  You can byte-compile an entire directory full of Lisp files with
  byte-recompile-directory.

* File variable

  Whenever Emacs visits a new file, it scans near the end[22] for a block of
  text that looks like this: Local variables: var1: value1 var2: value2 ... End:
  When Emacs finds such a block, it assigns each value to the corresponding var,
  which is automatically made buffer-local.

  Emacs can recognize this block even if each line begins with a prefix, as long
  as they all begin with the same prefix. This is necessary in a file of Lisp
  code, for example, to comment out the lines so they’re not interpreted as
  Lisp:

  Any file that needs update-writestamps in its local-write-file-hooks could
  therefore specify: Local variables: local-write-file-hooks:
  (update-writestamps) End: In fact, a file could set up all of the unique
  values it needs: Local variables: local-write-file-hooks: (update-writestamps)
  writestamp-prefix: "Written:" writestamp-suffix: "." writestamp-format: "%D"
  End:


  Emacs recognizes a “pseudovariable” in the local variables list called eval.
  When eval: value

  eval: (add-hook 'local-write-file-hooks 'update-writestamps)

* List

  car yields the first element in a list, and cdr yields the remainder of the
  list

  (Recall that quoting an expression — even a complete list — means to use that
  expression literally. So '(a b c) means the list containing a, b, and c, not
  the result of calling function a on arguments b and c.)

  Lists are constructed with the functions list, cons, and append.


  The function list makes a list out of any number of arguments:


  The function cons takes an arbitrary Lisp expression and an existing list. It
  makes a new list by prepending the arbitrary expression to the old list:


  The function append takes any number of lists and makes a new list by
  concatenating the top-level elements of all the lists.


  The function reverse takes a list and makes a new list by reversing its
  top-level elements.


  Lists are composed of smaller data structures called cons cells. A cons cell
  is a structure that contains two Lisp expressions, referred to, you may not be
  surprised to learn, as the cell’s car and cdr.


  There’s a special syntax for cons cells whose cdrs aren’t lists. It’s called
  dotted pair notation, and cons cells themselves are sometimes referred to as
  dotted pairs:


  A list where the last cdr is not nil is sometimes called an improper list.
  Frequently, the entries in an association list (see below) are improper lists.

  consp tests whether its argument is a cons cell. (consp x) is true when x is
  any list except the empty list, and false for all other objects. atom tests
  whether its argument is atomic. (atom x) is the opposite of (consp x) —
  everything that’s not a cons cell, including nil, numbers, strings, and
  symbols, is an atom. listp tests whether its argument is a list. (listp x) is
  true for all cons cells and for nil, false for everything else.

  null tests whether its argument is nil.

  Other Useful List Functions Here are some more list-related Lisp functions
  that Emacs defines.

  Enter setcar and setcdr. [26] Given a cons cell and a new value, these
  functions replace the cell’s car or cdr with the new value.

  There is one other important destructive list operation: nreverse,

  A list can be made to refer to part of itself! Consider: (setq x '(a b c))
  (nthcdr 2 x) ⇒ (c) (setcdr (nthcdr 2 x) x)      ;don't try this yet!

  What does this list look like? Well, it starts out like this: (a b c a b c a b
  c a b c a b c a b c a b c a b c ... and it never stops.

* Syntax table

  syntax table is a mode-specific mapping from characters to “syntax classes.”


  The syntax table is used by commands like forward-word and backward-word to
  figure out just what a word is. Because different buffers can have different
  syntax tables, the definition of a word can vary from one buffer to another.

  The function char-syntax returns a character’s syntax code as another
  character.

* Macro function

  It is possible to write a special kind of function, called a macro
  function,[31] that behaves as though its arguments are quoted. That is, when a
  macro function is invoked, its arguments are not evaluated before the function
  gets control.

  Macro functions are defined with defmacro (whose syntax resembles defun). The
  way to write incr is: (defmacro incr (var)   "Add one to the named variable."
    (list 'setq var (list '+ var 1)))

  The body of a macro function produces an expansion of its input. The expansion
  then gets evaluated. The expansion of (incr x) is: (setq x (+ x 1)) When that
  expression is evaluated, x is incremented.

  You can debug macro functions using the function macroexpand.

* Backquote

  Backquote is just like quote, meaning that the result of evaluating a
  backquoted expression is the expression itself: `(a  b  c) ⇒ (a  b  c) There
  is one important difference, however. A backquoted list’s subexpressions may
  be individually unquoted using yet more special syntax. This means that when
  the backquoted expression is evaluated, the unquoted subexpressions actually
  do get evaluated — but the rest of the list remains quoted! `(a ,b  c) ⇒ (a
  value-of- b c)

* Remove outer parentheses

  What we need instead is a way to splice the value of subexprs into the
  surrounding list, removing the outer parentheses. For this purpose, Emacs Lisp
  has one more special bit of syntax (last one, I promise): the splicing unquote
  operator, ,@.

* Let

  With let*, there is no ambiguity: the order in which the vals are evaluated is
  the same as the order in which they’re written.[

  The way to create such a symbol is with the function make-symbol, which takes
  the symbol’s name (as a string) and creates a brand-new, uninterned object
  guaranteed not to be equal, in the sense of eq, to any other Lisp object.

* Fail gracefully

  It is possible to write Lisp code that gets executed while the stack is being
  unwound! This is the key to writing code that fails "gracefully,” cleaning up
  after itself if it doesn’t get the chance to finish due to some error (or due
  to the user interrupting the operation with C-g). The function to use is
  called unwind-protect,

* defalias

  (defalias 'backward-quip 'backward-page) (defalias 'forward-quip
  'forward-page) (defalias 'narrow-to-quip 'narrow-to-page) (defalias 'what-quip
  'what-page)

