_org/books/Writing GNU Emacs Extensions.org
* Keymap

  The global keymap, mentioned above, is always active. It can be superseded by
  entries in a buffer’s local keymap, which contains special keybindings for the
  current major mode. That, in turn, can be superseded by the entries in the
  minor mode keymap corresponding to any minor modes that are active.[37


  We use make-sparse-keymap because Quip mode has only a few special keybindings
  beyond the ones found in the global keymap. Only when a keymap has more than a
  couple dozen keybindings should a full keymap be created with make-keymap.

  If users wish to alter Quip mode’s keybindings, they can do so using a mode
  hook and local-set-key (which, within Quip mode, alters quip-mode-map):

  substitute-key-definition does. (substitute-key-definition 'beginning-of-line
                             'crossword-beginning-of-row

  This situation is partially alleviated with suppress-keymap, which causes all
  self-inserting keys to become undefined. We should call suppress-keymap
  immediately after creating the keymap, before starting to define keys in it.
  (if crossword-mode-map     nil   (setq crossword-mode-map (make-keymap))
    (suppress-keymap crossword-mode-map)   ...) This only gets rid of
  self-inserting keys, leaving other dangerous keys like C-w and C-y lurking
  about. A more complete (and more drastic) solution is to place a catch-all
  binding in crossword-mode-map: (define-key crossword-mode-map [t] 'undefined)
  In this call to define-key,

* derive-mode

  it’s so common to derive new modes by varying existing ones — just as we’ve
  varied Text mode to get Quip mode — that there’s an Emacs Lisp package to
  simplify this task. The package is called derived and the central function it
  provides is called define-derived-mode.

* Vectors

  Vectors are self-evaluating; that is, the result of evaluating a vector is the
  vector itself. Its subexpressions are not evaluated. So if you write: [a b c]
  you’ll get a vector containing the three symbols, a, b, and c. If you want a
  vector containing the values of variables a, b, and c, you must construct the
  vector using the vector function: (vector a b c) ⇒ [17 37 42]

* Inline functions

  When function definitions are very short, like these last four, it’s usually a
  good idea to turn them into inline functions using defsubst instead of defun.

* Equivalence pairs

  We create a list of "equivalence pairs” in equivs.

* Mouse

  When you press a key, you generate a numeric code that can be used to index
  the vector, or it can be used as the search key in an assoc search. When you
  press a mouse button, you generate a symbol that can only be used in an assoc
  search. The symbol down-mouse-1, for instance, represents a press of mouse
  button 1 (usually the left mouse button), while the symbol mouse-1 represents
  button 1 being released. (It is customary for a button press to initiate an
  action by noting the position of the mouse pointer, and for a button release
  to complete an action by noting whether the mouse has moved since the
  corresponding button press.) Other mouse-event symbols include C-down-mouse-2
  (pressing the middle mouse button while holding the control key),
  S-drag-mouse-3 (shift key plus mouse motion with button 3 depressed), and
  double-mouse-1 (after releasing mouse button 1 for the second time in a
  double-click). Another difference between mouse input and keyboard input is
  that when you press a mouse button, there is additional data associated with
  the button press: for instance, there’s the location in the window where you
  pressed it. Keyboard input always happens at “point,” but mouse input happens
  wherever the mouse is. For this reason, mouse input is represented by a data
  structure called an input event. A command bound to a mouse action can access
  the current event by calling last-input-event, or by using the e code letter
  in its interactive declaration.



  Menu keymaps must have an "overall prompt string.” That’s the meaning of the
  optional argument "Crossword" in this call to make-sparse-keymap.


(define-key crossword-mode-map [menu-bar crossword]             (cons
"Crossword" crossword-menu-map))

* Asynchronous

  An asynchronous process object is a Lisp data structure that represents
  another running program on your computer. New processes are created with
  start-process, which resembles call-process (which we saw in the previous
  section). Unlike call-process, however, start-process does not wait for the
  executed program to complete. Instead, it returns a process object.

* Process
  One more thing about start-process. When Emacs creates the process, it
  maintains a connection to it (through which input and output flow) using
  either UNIX pipes or UNIX pseudo-ttys. Pipes are more appropriate for
  non-interactive processes like egrep, while pseudo-ttys, or ptys, are more
  appropriate for interactive programs — e.g., command interpreters like the
  UNIX shell. The kind of connection that is created by start-process is
  controlled by the variable process-connection-type — nil means use pipes, t
  means use ptys.

  Though it’s a little baroque, it’s a good idea always to wrap calls to
  start-process inside a let call where you temporarily set
  process-connection-type to the desired value, as in: ... (let
  ((process-connection-type nil))   (start-process "egrep"                 
  buffer                  crossword-egrep-program                  "-i" regexp
  crossword-words-file)) ...

** Sentinel

   sentinel is a Lisp function that gets called when the process changes state.
   We’re interested in the state change that happens when the program exits; but
   state changes can also happen when the process receives a signal.

   (set-process-sentinel process                         
    'crossword--egrep-sentinel))))))))

   We can define crossword--egrep-sentinel as: (defun crossword--egrep-sentinel
   (process string)   "When PROCESS exits, display its buffer."   (if (eq
   (process-status process)           'exit)       (display-buffer
   (process-buffer process))))

* Filter

  A filter is a function that gets called whenever output from the process
  arrives.

  (set-process-filter process                         'crossword--egrep-filter)

  (defun crossword--egrep-filter (process string)   "Handle output from
  PROCESS."    (let ((buffer (process-buffer process)))     (save-excursion     
   (set-buffer buffer)       (goto-char (point-max))       (insert string))   
   (display-buffer buffer)))

