_org/books/Writing GNU Emacs Extensions.org
* Eval lisp

  Lisp expression in any buffer can be evaluated by placing the cursor at the
  end of the expression and pressing C-x C-e (eval-last-sexp). The keystroke M-:
  (eval-expression) prompts for a Lisp expression to evaluate in the minibuffer.
  You can also use the commands eval-region and eval-current-buffer.

  M-x lisp-interaction-mode RET). In that mode, C-j is normally
  eval-print-last-sexp, which is like eval-last-sexp except that it also inserts
  the result of evaluation into the buffer.

  You can use the command eval-last-sexp, which is bound to C-x C-e.
  eval-expression, which is bound to M-:[

* debugger

  Entering the debugger is controlled as follows. debug-on-entry

  debug-on-error

  debug-on-next-call

  debug-on-quit This

  Edebug is an elaborate debugging environment that is far more powerful than
  the debugging facilities described in the previous section.

* Profiling

  Barry Warsaw has written an ingenious package for profiling Emacs Lisp called
  ELP. This syntax is magic. When the docstring is displayed to the user — such
  as when the user uses apropos or describe-variable — \[command] is replaced
  with a representation of a keybinding that invokes command. For example, if
  C-x t invokes insert-time, then the docstring "*Format for \\[insert-time]
  (c.f. 'format-time-string')." is displayed as *Format for C-x t (c.f.
  'format-time-string').
