books/Writing GNU Emacs Extensions.html

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> Eval lisp</h2>
<div class="outline-text-2" id="text-41">
<p>
Lisp expression in any buffer can be evaluated by placing the cursor at the
end of the expression and pressing C-x C-e (eval-last-sexp). The keystroke M-:
(eval-expression) prompts for a Lisp expression to evaluate in the minibuffer.
You can also use the commands eval-region and eval-current-buffer.
</p>

<p>
M-x lisp-interaction-mode RET). In that mode, C-j is normally
eval-print-last-sexp, which is like eval-last-sexp except that it also inserts
the result of evaluation into the buffer.
</p>

<p>
You can use the command eval-last-sexp, which is bound to C-x C-e.
eval-expression, which is bound to M-:[
</p>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> debugger</h2>
<div class="outline-text-2" id="text-42">
<p>
Entering the debugger is controlled as follows. debug-on-entry
</p>

<p>
debug-on-error
</p>

<p>
debug-on-next-call
</p>

<p>
debug-on-quit This
</p>

<p>
Edebug is an elaborate debugging environment that is far more powerful than
the debugging facilities described in the previous section.
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> Profiling</h2>
<div class="outline-text-2" id="text-43">
<p>
Barry Warsaw has written an ingenious package for profiling Emacs Lisp called
ELP. This syntax is magic. When the docstring is displayed to the user — such
as when the user uses apropos or describe-variable — \[command] is replaced
with a representation of a keybinding that invokes command. For example, if
C-x t invokes insert-time, then the docstring "*Format for \\[insert-time]
(c.f. 'format-time-string')." is displayed as *Format for C-x t (c.f.
'format-time-string').
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div>
